Revit 2026 API

# MasonryCMUMasonryCMUPattern Property

---

The property labeled "Relief Pattern" from the "MasonryCMU" schema.

**Namespace:** Autodesk.Revit.DB.Visual**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static string MasonryCMUPattern { get; }
```
```vb
Public Shared ReadOnly Property MasonryCMUPattern As String
	Get
```
```cpp
public:
static property String^ MasonryCMUPattern {
	String^ get ();
}
```
```fsharp
static member MasonryCMUPattern : string with get
```

#### Property Value

String

This property is of type "AssetPropertyInteger" with accepted values in the enumerated type "MasonryCMUPatternType".

#### Reference

MasonryCMU Class

Autodesk.Revit.DB.Visual Namespace